# #任务一：复习呼吸灯
# import time
# from machine import Pin, PWM
# led_pwm = PWM(Pin(14),freq = 0.5)

# duty = 0
# step = 10
# delay = 0.02
# while True:
#     for duty in range(0,1024,step):
#         led_pwm.duty(duty)
#         time.sleep(delay)
#         if duty == 1023:
#             print("最亮")
#     for duty in range(1023,-1,-step):
#         pwm.duty(duty)
#         time.sleep(delay)
#         if duty == 0:
#             print("最暗")














# #任务二：pwm控制舵机
# import machine
# import time

# pwm = machine.PWM(machine.Pin(15), freq=50)#舵机的频率为50Hz，这是舵机通信协议规定的
# def set_servo_angle(angle):
#     if 0 <= angle <= 180:
#         duty_ns = int(0.5000 + (angle / 180) * 200000)
#         pwm.duty_ns(duty_ns)#wokwi中使用ns来设定脉冲宽度，0.5000ns对应0度，0.20.500ns对应180度
# print("初始化舵机到0度")#程序开始时，不只是舵机，务必把led,继电器，电机等执行器件初始化到一个安全状态
# set_servo_angle(0)
# time.sleep(1)
# while True:
#     print("Turning to 90 degrees")
#     set_servo_angle(90)
#     time.sleep(2)
#     print("Turning to 180 degrees")
#     set_servo_angle(135)
#     time.sleep(2)

# #以上程序有什么问题？




# #这是老师给的代码
# import machine
# import time

# # ----- 1：适配ESP32 PWM引脚-----
# # ESP32 D15支持PWM功能
# pwm = machine.PWM(machine.Pin(15),freq=50)
# # 设置PWM频率为50Hz（伺服电机标准频率）

# # ----- 核心逻辑：伺服电机角度控制函数-----
# def set_servo_angle(angle):
#     if 0 <= angle <= 180:
#         # 将角度(0-180)映射到脉冲宽度(0.5k-2.5M纳秒)，适配Wokwi舵机特性
#         duty_ns = int(0.5000 + (angle / 180) * 2000000)
#         pwm.duty_ns(duty_ns)
# # ----- 关键修正：初始化位置-----
# # 确保电机启动后有明确位置
# print("初始化位置：关闭 (0度)")
# set_servo_angle(0)
# time.sleep(1) # 等待1秒，确保电机到位

# # ----- 主循环：开关测试-----
# while True:
#     print("开启 (90度)")
#     set_servo_angle(135)
#     time.sleep(2)
    
#     print("关闭 (0度)")
#     set_servo_angle(0)
#     time.sleep(2)














# #任务三：串口控制舵机和LED
# import sys
# import time
# import machine

# # ----- 关键修改1：适配ESP32硬件引脚-----
# print("Initializing hardware...")
# # LED：ESP32用D15，输出模式
# led = machine.Pin(15, machine.Pin.OUT)
# led.off()  # 初始状态关闭

# # 伺服电机：ESP32用D2，PWM模式（频率50Hz，与原代码一致）
# servo_pwm = machine.PWM(machine.Pin(2))
# servo_pwm.freq(50)

# # ----- 核心函数：伺服电机角度控制-----
# def set_servo_angle(angle):
#     """设置伺服电机角度（0-180度）"""
#     if 0 <= angle <= 180:
#         # 映射角度到脉冲宽度（0.5k-2.5M纳秒，适配舵机标准）
#         duty_ns = int(0.5000 + (angle / 180) * 2000000)
#         servo_pwm.duty_ns(duty_ns)
#         print(f"伺服电机已转到 {angle} 度")
#     else:
#         print("错误: 角度必须在0-180之间")

# # ----- 主程序：串口指令解析-----
# print("远程命令解析器已就绪。")
# print("可用指令: 'led on', 'led off', 'servo:角度值'")
# set_servo_angle(0)  # 伺服电机初始位置（与原代码一致）

# while True:
#     # 读取串口输入指令
#     command = sys.stdin.readline()
    
#     if command:
#         # 清理指令（去除空格、转为小写，不区分大小写）
#         clean_command = command.strip().lower()
#         print(f"\n收到指令: '{clean_command}'")
        
#         # 解析LED控制指令
#         if clean_command == "led on":
#             led.on()
#             print("LED已点亮")
#         elif clean_command == "led off":
#             led.off()
#             print("LED已熄灭")
            
#         # 解析伺服电机控制指令（格式：servo:角度值）
#         elif clean_command.startswith("servo:"):
#             try:
#                 parts = clean_command.split(':')
#                 angle_value = int(parts[1])
#                 set_servo_angle(angle_value)
#             except (IndexError, ValueError):
#                 print("错误: servo指令格式不正确，应为 'servo:角度值'")
        
#         # 未知指令处理
#         else:
#             print(f"未知指令: '{clean_command}'")









#任务四：加上按键控制
#待完成……
















#任务五：密码锁
#待完成……





















# #任务六：无源蜂鸣器
# #有源蜂鸣器内部自带振荡电路，只需接通电源即可发声，但缺点是只能发出固定频率的声音。
# #无源蜂鸣器可以通过改变输入的频率来发出不同音高的声音，更加灵活，适合做简单的音乐播放。
# from machine import Pin, PWM  # 按需导入Pin和PWM，无需machine.前缀
# import utime  

# # 将 GPIO15 设置为PWM输出引脚
# buzzer_pin = Pin(4)
# buzzer = PWM(buzzer_pin)

# 音符频率表 (单位：赫兹 Hz)
# # 这是一个简化的音阶，C4就是中央C (Do)
# NOTE_C4 = 262
# NOTE_D4 = 294
# NOTE_E4 = 330
# NOTE_F4 = 349
# NOTE_G4 = 392
# # ... 更多音符



# def play_tone(frequency):
#     """以指定频率播放声音"""
#     if frequency > 0:
#         buzzer.freq(frequency)    # 设置频率（音高）
#         buzzer.duty_u16(32768)  # 设置占空比（音量），一半占空比通常音量最大
#     else:
#         stop_tone()

# def stop_tone():
#     """停止发声"""
#     buzzer.duty_u16(0) # 将占空比设为0即可静音

# # --- 测试 ---
# while True:
#     print("Playing Do (C4)")
#     play_tone(NOTE_C4)
#     utime.sleep(0.5) # 持续0.5秒（替换time.sleep为utime.sleep）
#     stop_tone()
#     utime.sleep(0.5)

#     print("Playing Re (D4)")
#     play_tone(NOTE_D4)
#     utime.sleep(0.5)
#     stop_tone()
#     utime.sleep(0.5)
    
#     print("Playing Mi (E4)")
#     play_tone(NOTE_E4)
#     utime.sleep(0.5)
#     stop_tone()
#     utime.sleep(0.5)







# #任务七：播放简单乐曲
# #---------------------------------------------------------
# from machine import Pin, PWM  # 按需导入Pin和PWM 
# import utime   

# # ----- ESP32 PWM引脚（D15） -----
# buzzer = PWM(Pin(4))  

# # ----- 核心乐谱数据-----
# #用字典来封装乐谱，好处是数据与逻辑分离，更换乐谱时只需修改数据部分，这是面向对象编程的思想之一
# NOTES = {
#     'C4': 262, 'D4': 294, 'E4': 330, 'F4': 349, 
#     'G4': 392, 'A4': 440, 'B4': 494, 'C5': 523,
#     'REST': 0  # REST代表休止符
# }

# # # 歌曲旋律（一闪一闪亮晶晶）：(音符, 节拍)
# # SONG = [
# #     ('C4', 1), ('C4', 1), ('G4', 1), ('G4', 1),
# #     ('A4', 1), ('A4', 1), ('G4', 2),
# #     ('F4', 1), ('F4', 1), ('E4', 1), ('E4', 1),
# #     ('D4', 1), ('D4', 1), ('C4', 2),
# # ]



# # 歌曲旋律（两只老虎）：(音符, 节拍)
# SONG = [
#     # 第一段
#     ('C4', 1), ('D4', 1), ('E4', 1), ('C4', 1),
#     ('C4', 1), ('D4', 1), ('E4', 1), ('C4', 1),
#     ('E4', 1), ('F4', 1), ('G4', 2),
#     ('E4', 1), ('F4', 1), ('G4', 2),
#     # 第二段
#     ('G4', 0.5), ('A4', 0.5), ('G4', 0.5), ('F4', 0.5),
#     ('E4', 1), ('C4', 1),
#     ('G4', 0.5), ('A4', 0.5), ('G4', 0.5), ('F4', 0.5),
#     ('E4', 1), ('C4', 1),
#     # 第三段（结尾）
#     ('D4', 1), ('G4', 1), ('C4', 2),
#     ('D4', 1), ('G4', 1), ('C4', 2),
# ]


# # 歌曲速度：每拍持续时间（秒）
# BEAT_DURATION = 0.4

# # ----- 核心播放函数-----
# def play_note(note, duration_beats):
#     """播放单个音符，包含PWM频率设置与持续时间控制"""
#     print(f"Playing note: {note}, for {duration_beats} beats")
#     frequency = NOTES.get(note, 0)
    
#     if frequency > 0:
#         buzzer.freq(frequency)  # 直接调用PWM的freq方法
#         buzzer.duty_u16(32768)  # 50%占空比（控制音量）
    
#     utime.sleep(duration_beats * BEAT_DURATION)
    
#     buzzer.duty_u16(0)  # 停止发声
#     utime.sleep(0.05)  # 音符间隔 

# # ----- 主循环-----
# print("音乐播放器已启动...")

# while True:
#     print("\n--- Playing 'Twinkle Twinkle Little Star' ---")
#     for note, beats in SONG:
#         play_note(note, beats)
    
#     print("--- Song Finished. Restarting in 2 seconds. ---")
#     utime.sleep(2)   













# #任务八：多首歌曲选择播放
# from machine import Pin, PWM
# import utime

# # --------------------------------------------------
# # 蜂鸣器初始化：防止上电/启动时发出杂音
# # --------------------------------------------------
# # 先将 GPIO15 设为普通输出模式，并强制拉低电平
# buzzer_pin = Pin(15, Pin.OUT)
# buzzer_pin.value(0)          # 确保初始为低电平
# utime.sleep_ms(10)           # 短暂延时，稳定电平

# # 再切换为 PWM 模式，用于控制音高和发声
# buzzer = PWM(buzzer_pin)
# buzzer.freq(1000)            # 初始频率设为 1000Hz（任意值均可）
# buzzer.duty_u16(0)           # 占空比为 0 → 完全静音！

# # --------------------------------------------------
# # 音符定义：音名 -> 频率（Hz）
# # C4 为中央 Do，A4 = 440Hz 为标准音
# # --------------------------------------------------
# NOTES = {
#     'C4': 262, 'D4': 294, 'E4': 330, 'F4': 349,
#     'G4': 392, 'A4': 440, 'B4': 494, 'C5': 523,
#     'REST': 0   # 休止符（不发声）
# }

# # 每拍持续时间（秒），可调节歌曲速度
# BEAT_DURATION = 0.4

# # --------------------------------------------------
# # 播放单个音符的函数
# # 参数：
# #   note: 音符名称，如 'C4'
# #   duration_beats: 持续几拍（1 = 一拍，0.5 = 半拍）
# # --------------------------------------------------
# def play_note(note, duration_beats):
#     # 从字典中查找对应频率，找不到则默认为 0（静音）
#     frequency = NOTES.get(note, 0)
    
#     if frequency > 0:
#         # 设置 PWM 频率（决定音高）
#         buzzer.freq(frequency)
#         # 设置占空比为 50%（32768 / 65535 ≈ 0.5），音量最大
#         buzzer.duty_u16(32768)
#     else:
#         # 休止符：关闭声音
#         buzzer.duty_u16(0)
    
#     # 按节拍持续发声
#     utime.sleep(duration_beats * BEAT_DURATION)
    
#     # 音符结束后立即静音，避免拖尾
#     buzzer.duty_u16(0)
#     # 音符间加一点间隔，让旋律更清晰
#     utime.sleep(0.05)

# # --------------------------------------------------
# # 播放整首歌曲的函数
# # 参数：
# #   song_name: 歌曲名称（用于打印提示）
# #   song_data: 歌曲数据，格式为 [('C4', 1), ('D4', 0.5), ...]
# # --------------------------------------------------
# def play_song(song_name, song_data):
#     print(f"\n--- 🎵 正在播放: {song_name} ---")
#     for note, beats in song_data:
#         play_note(note, beats)
#     print("--- 播放结束 ---")

# # --------------------------------------------------
# # 歌曲列表：支持任意数量的歌曲
# # 每首歌是一个元组：("歌名", [乐谱])
# # 可在此处轻松添加新歌曲！
# # --------------------------------------------------
# SONGS = [
#     ("一闪一闪亮晶晶", [
#         ('C4', 1), ('C4', 1), ('G4', 1), ('G4', 1),
#         ('A4', 1), ('A4', 1), ('G4', 2),
#         ('F4', 1), ('F4', 1), ('E4', 1), ('E4', 1),
#         ('D4', 1), ('D4', 1), ('C4', 2),
#     ]),
#     ("两只老虎", [
#         ('C4', 1), ('D4', 1), ('E4', 1), ('C4', 1),
#         ('C4', 1), ('D4', 1), ('E4', 1), ('C4', 1),
#         ('E4', 1), ('F4', 1), ('G4', 2),
#         ('E4', 1), ('F4', 1), ('G4', 2),
#         ('G4', 0.5), ('A4', 0.5), ('G4', 0.5), ('F4', 0.5),
#         ('E4', 1), ('C4', 1),
#         ('G4', 0.5), ('A4', 0.5), ('G4', 0.5), ('F4', 0.5),
#         ('E4', 1), ('C4', 1),
#         ('D4', 1), ('G4', 1), ('C4', 2),
#         ('D4', 1), ('G4', 1), ('C4', 2),
#     ])
# ]

# # --------------------------------------------------
# # 按钮初始化（连接到 GPIO4）
# # 使用内部上拉电阻，按钮按下时引脚为低电平
# # --------------------------------------------------
# button = Pin(4, Pin.IN, Pin.PULL_UP)

# # 当前选中的歌曲索引（从 0 开始）
# current_index = 0

# # --------------------------------------------------
# # 主程序开始
# # --------------------------------------------------
# print("🎧 单按钮点歌台已启动！")
# print("• 短按 (<1秒)：播放当前歌曲")
# print("• 长按 (≥1秒)：切换到下一首")
# print(f"▶ 当前歌曲: {SONGS[current_index][0]}")

# # 主循环
# while True:
#     # 检测按钮是否被按下（低电平表示按下）
#     if not button.value():
#         # 记录按下开始时间
#         press_start = utime.ticks_ms()
        
#         # 等待用户松开按钮
#         while not button.value():
#             utime.sleep_ms(10)  # 避免忙等待，节省资源
        
#         # 计算按下持续时间（单位：毫秒）
#         press_duration = utime.ticks_diff(utime.ticks_ms(), press_start)
        
#         if press_duration >= 1000:
#             # 长按（≥1秒）：切换到下一首（循环）
#             current_index = (current_index + 1) % len(SONGS)
#             print(f"\n⏭️ 已切换到: {SONGS[current_index][0]}")
#         else:
#             # 短按（<1秒）：播放当前选中的歌曲
#             name, data = SONGS[current_index]
#             play_song(name, data)
    
#     # 主循环短延时，降低 CPU 占用
#     utime.sleep_ms(50)








#任务九：熙熙攘攘，我们的蜂鸣器
#---------------------------------------------------------
from machine import Pin, PWM  # 按需导入Pin和PWM 
import utime   

# ----- ESP32 PWM引脚（D15） -----
buzzer = PWM(Pin(4))  

# ----- 核心乐谱数据-----
#用字典来封装乐谱，好处是数据与逻辑分离，更换乐谱时只需修改数据部分，这是面向对象编程的思想之一
NOTES = {
    'NOTE_C0': 16,
    'NOTE_C1': 33,
    'NOTE_C2': 65,
    'NOTE_C3': 131,
    'NOTE_C4': 262,
    'NOTE_C5': 523,
    'NOTE_C6': 1047,
    'NOTE_C7': 2093,
    'NOTE_C8': 4186,
    'NOTE_CS0': 17,
    'NOTE_CS1': 35,
    'NOTE_CS2': 69,
    'NOTE_CS3': 139,
    'NOTE_CS4': 277,
    'NOTE_CS5': 554,
    'NOTE_CS6': 1109,
    'NOTE_CS7': 2217,
    'NOTE_CS8': 4435,
    'NOTE_D0': 18,
    'NOTE_D1': 37,
    'NOTE_D2': 73,
    'NOTE_D3': 147,
    'NOTE_D4': 294,
    'NOTE_D5': 587,
    'NOTE_D6': 1175,
    'NOTE_D7': 2349,
    'NOTE_D8': 4699,
    'NOTE_DS0': 19,
    'NOTE_DS1': 39,
    'NOTE_DS2': 78,
    'NOTE_DS3': 156,
    'NOTE_DS4': 311,
    'NOTE_DS5': 622,
    'NOTE_DS6': 1245,
    'NOTE_DS7': 2489,
    'NOTE_DS8': 4978,
    'NOTE_E0': 21,
    'NOTE_E1': 41,
    'NOTE_E2': 82,
    'NOTE_E3': 165,
    'NOTE_E4': 330,
    'NOTE_E5': 659,
    'NOTE_E6': 1319,
    'NOTE_E7': 2637,
    'NOTE_E8': 5274,
    'NOTE_F0': 22,
    'NOTE_F1': 44,
    'NOTE_F2': 87,
    'NOTE_F3': 175,
    'NOTE_F4': 349,
    'NOTE_F5': 698,
    'NOTE_F6': 1397,
    'NOTE_F7': 2794,
    'NOTE_F8': 5588,
    'NOTE_FS0': 23,
    'NOTE_FS1': 46,
    'NOTE_FS2': 93,
    'NOTE_FS3': 185,
    'NOTE_FS4': 370,
    'NOTE_FS5': 740,
    'NOTE_FS6': 1480,
    'NOTE_FS7': 2960,
    'NOTE_FS8': 5920,
    'NOTE_G0': 24,
    'NOTE_G1': 49,
    'NOTE_G2': 98,
    'NOTE_G3': 196,
    'NOTE_G4': 392,
    'NOTE_G5': 784,
    'NOTE_G6': 1568,
    'NOTE_G7': 3136,
    'NOTE_G8': 6272,
    'NOTE_GS0': 26,
    'NOTE_GS1': 52,
    'NOTE_GS2': 103,
    'NOTE_GS3': 207,
    'NOTE_GS4': 416,
    'NOTE_GS5': 831,
    'NOTE_GS6': 1663,
    'NOTE_GS7': 3325,
    'NOTE_GS8': 6651,
    'NOTE_A0': 28,
    'NOTE_A1': 55,
    'NOTE_A2': 110,
    'NOTE_A3': 220,
    'NOTE_A4': 440,
    'NOTE_A5': 880,
    'NOTE_A6': 1760,
    'NOTE_A7': 3520,
    'NOTE_A8': 7040,
    'NOTE_AS0': 29,
    'NOTE_AS1': 58,
    'NOTE_AS2': 117,
    'NOTE_AS3': 233,
    'NOTE_AS4': 466,
    'NOTE_AS5': 932,
    'NOTE_AS6': 1865,
    'NOTE_AS7': 3729,
    'NOTE_AS8': 7459,
    'NOTE_B0': 31,
    'NOTE_B1': 62,
    'NOTE_B2': 123,
    'NOTE_B3': 247,
    'NOTE_B4': 494,
    'NOTE_B5': 988,
    'NOTE_B6': 1976,
    'NOTE_B7': 3951,
    'NOTE_B8': 7902,
    'REST': 0
}


# 歌曲旋律（熙熙攘攘）：(音符, 节拍)
SONG = [
    ('NOTE_A3', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.15), ('NOTE_D4', 0.15), ('NOTE_C4', 0.25), ('NOTE_G3', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.25), ('NOTE_E3', 0.25),
    ('NOTE_A3', 0.25), ('NOTE_E4', 0.15), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.15), ('NOTE_D4', 0.15), ('NOTE_D4', 0.15), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25), ('NOTE_A3', 0.25), ('NOTE_A3', 0.15), ('NOTE_G3', 0.25), ('NOTE_E3', 0.25),
    ('NOTE_A3', 0.25), ('NOTE_G4', 0.15), ('NOTE_G4', 0.25), ('NOTE_E4', 0.15), ('NOTE_A3', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_E4', 0.15), ('NOTE_E4', 0.15), ('NOTE_D4', 0.15), ('NOTE_E4', 0.25), ('NOTE_D4', 0.15), ('NOTE_E4', 0.25), ('NOTE_D4', 0.15), ('NOTE_E4', 0.5),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_G4', 0.25), ('NOTE_D4', 0.5), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.125), ('NOTE_A3', 0.125),
    ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.5), ('NOTE_C5', 0.125), ('NOTE_B4', 0.125), ('NOTE_G4', 0.125),
    ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_G4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_C3', 0.125), ('NOTE_B4', 0.125), ('NOTE_G4', 0.125), ('NOTE_E4', 0.125),
    ('NOTE_E4', 0.125), ('NOTE_G4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_A4', 0.125), ('NOTE_G4', 0.125), ('NOTE_A4', 0.125), ('NOTE_B4', 0.125), ('NOTE_C5', 0.125),
    ('NOTE_D5', 0.125), ('NOTE_B4', 0.125), ('NOTE_C5', 0.125), ('NOTE_D5', 0.125), ('NOTE_B4', 0.125), ('NOTE_C5', 0.125), ('NOTE_G5', 0.125), ('NOTE_F5', 0.125), ('NOTE_E5', 0.125),
    ('NOTE_D5', 0.125), ('NOTE_C5', 0.125), ('NOTE_A5', 0.125), ('NOTE_G5', 0.125), ('NOTE_A5', 0.125), ('NOTE_B5', 0.125), ('NOTE_C6', 0.125), ('NOTE_B5', 0.125), ('NOTE_C6', 0.125),
    ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_G6', 0.125), ('NOTE_G6', 0.125), ('NOTE_E6', 0.125), ('NOTE_D6', 0.125), ('NOTE_C6', 0.125),
    ('NOTE_A5', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_A5', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_A5', 0.125), ('NOTE_G6', 0.125), ('NOTE_A6', 0.125),
    ('NOTE_E6', 0.125), ('NOTE_G6', 0.125), ('NOTE_A6', 0.125), ('NOTE_A5', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.25),
    ('NOTE_E3', 0.25), ('NOTE_E3', 0.125), ('NOTE_E3', 0.125), ('NOTE_D3', 0.25), ('NOTE_E3', 0.25), ('NOTE_G3', 0.25), ('NOTE_G3', 0.5),
    ('NOTE_E3', 0.25), ('NOTE_F3', 0.25), ('NOTE_G3', 0.25), ('NOTE_G3', 0.125), ('NOTE_G3', 0.25), ('NOTE_F3', 0.25), ('NOTE_E3', 0.25),
    ('NOTE_D3', 0.25), ('NOTE_D3', 0.25), ('NOTE_E3', 0.125), ('NOTE_E3', 0.25), ('NOTE_F3', 0.25), ('NOTE_E3', 0.5), ('NOTE_E3', 0.25),
    ('NOTE_E3', 0.125), ('NOTE_E3', 0.125), ('NOTE_D3', 0.25), ('NOTE_E3', 0.25), ('NOTE_F3', 0.25), ('NOTE_G3', 0.5), ('NOTE_E3', 0.25),
    ('NOTE_F3', 0.25), ('NOTE_G3', 0.25), ('NOTE_G3', 0.125), ('NOTE_G3', 0.25), ('NOTE_C4', 0.25), ('NOTE_B3', 0.25), ('NOTE_G3', 0.25),
    ('NOTE_D4', 0.25), ('NOTE_D4', 0.125), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_E4', 0.5), ('NOTE_E4', 0.25), ('NOTE_E4', 0.125),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_B3', 0.5), ('NOTE_G3', 0.25), ('NOTE_G3', 0.25), ('NOTE_A3', 0.5), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_E4', 0.5), ('NOTE_E3', 0.25), ('NOTE_E4', 0.5), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_B3', 0.5), ('NOTE_G3', 0.25), ('NOTE_G3', 0.25), ('NOTE_A3', 0.5), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_G4', 0.25), ('NOTE_D4', 0.5), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.125), ('NOTE_A3', 0.125), ('NOTE_A3', 0.125), ('NOTE_E3', 0.125), ('NOTE_G3', 0.25), ('NOTE_D3', 0.25), ('NOTE_E3', 0.25), ('NOTE_A2', 0.125),
    ('NOTE_D3', 0.25), ('NOTE_E3', 0.25), ('NOTE_A4', 0.25), ('NOTE_C5', 0.25), ('NOTE_D5', 0.25), ('NOTE_A4', 0.25), ('NOTE_E5', 0.125), ('NOTE_G5', 0.125), ('NOTE_E5', 0.125), ('NOTE_C5', 0.125), ('NOTE_C5', 0.25), ('NOTE_D5', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.125),
    ('NOTE_A3', 0.125), ('NOTE_A3', 0.125), ('NOTE_E3', 0.125), ('NOTE_G3', 0.25), ('NOTE_D3', 0.125), ('NOTE_E3', 0.125), ('NOTE_D3', 0.25),
    ('NOTE_D3', 0.25), ('NOTE_E3', 0.125), ('NOTE_C6', 0.25), ('NOTE_B5', 0.25), ('NOTE_G5', 0.25), ('NOTE_E5', 0.25), ('NOTE_D5', 0.125),
    ('NOTE_C5', 0.125), ('NOTE_D5', 0.125), ('NOTE_A5', 0.125), ('NOTE_A3', 0.25), ('NOTE_B3', 0.125), ('NOTE_C4', 0.25), ('NOTE_B3', 0.125),
    ('NOTE_G3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.125), ('NOTE_E3', 0.25), ('NOTE_E3', 0.25), ('NOTE_E3', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_C3', 0.125), ('NOTE_B3', 0.125), ('NOTE_G3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_A3', 0.25), ('NOTE_A3', 0.25),
    ('NOTE_A4', 0.25), ('NOTE_D4', 0.125), ('NOTE_C4', 0.125), ('NOTE_D4', 0.125), ('NOTE_D4', 0.125), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_C4', 0.5), ('NOTE_E4', 0.25), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_B3', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.5), ('NOTE_D4', 0.5), ('NOTE_E4', 0.25),
    ('NOTE_F4', 0.125), ('NOTE_F4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.5), ('NOTE_E4', 0.150), ('NOTE_E4', 0.2), ('NOTE_B3', 0.25),
    ('NOTE_G3', 0.25), ('NOTE_B3', 0.25), ('NOTE_C4', 0.25), ('NOTE_B3', 0.125), ('NOTE_C4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125),
    ('NOTE_E4', 0.125), ('NOTE_D4', 0.125), ('NOTE_C4', 0.125), ('NOTE_E4', 0.25), ('NOTE_A4', 0.25), ('NOTE_G4', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_A3', 0.25), ('NOTE_E4', 0.125), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_B3', 0.125), ('NOTE_B3', 0.125), ('NOTE_G3', 0.25), ('NOTE_C4', 0.25), ('NOTE_G4', 0.125), ('NOTE_G4', 0.25), ('NOTE_F4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_C4', 0.25), ('NOTE_G3', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_G4', 0.25), ('NOTE_E4', 0.25), ('NOTE_B3', 0.25), ('NOTE_D4', 0.5), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_C4', 0.125), ('NOTE_D4', 0.125), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_D4', 0.25), ('NOTE_C4', 0.125), ('NOTE_D4', 0.125), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_C4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.25), ('NOTE_G4', 0.25), ('NOTE_G4', 0.5), ('NOTE_A4', 0.5), ('NOTE_G4', 0.5),
    ('NOTE_E4', 0.25), ('NOTE_E4', 0.125), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_C4', 0.5), ('NOTE_C4', 0.125), ('NOTE_C4', 0.125), ('NOTE_C4', 0.125),
    ('NOTE_C4', 0.125), ('NOTE_C4', 0.125), ('NOTE_C4', 0.125), ('NOTE_C4', 0.125), ('NOTE_C4', 0.125), ('NOTE_C4', 0.25), ('NOTE_G4', 0.25),
    ('NOTE_C4', 0.5), ('NOTE_E4', 0.5), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_G4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125),
    ('NOTE_D4', 0.125), ('NOTE_D4', 0.125), ('NOTE_C4', 0.25), ('NOTE_C4', 0.125), ('NOTE_A3', 0.25), ('NOTE_A3', 0.125), ('NOTE_G3', 0.25),
    ('NOTE_E3', 0.25), ('NOTE_A3', 0.25), ('NOTE_E4', 0.125), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_C4', 0.25),
    ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_D4', 0.125), ('NOTE_D4', 0.125), ('NOTE_C4', 0.25), ('NOTE_C4', 0.125),
    ('NOTE_A3', 0.25), ('NOTE_A3', 0.125), ('NOTE_G3', 0.25), ('NOTE_E3', 0.25), ('NOTE_A3', 0.25), ('NOTE_G4', 0.125), ('NOTE_G4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125),
    ('NOTE_D4', 0.125), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_E4', 0.5), ('NOTE_E4', 0.25),
    ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_C4', 0.25), ('NOTE_G4', 0.25), ('NOTE_D4', 0.5), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.125), ('NOTE_E4', 0.25),
    ('NOTE_A3', 0.25), ('NOTE_A3', 0.125), ('NOTE_A3', 0.125), ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_A3', 0.125),
    ('NOTE_G3', 0.125), ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_E4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_D4', 0.25), ('NOTE_C4', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.5), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.25),
    ('NOTE_A3', 0.25), ('NOTE_E4', 0.25), ('NOTE_A3', 0.25), ('NOTE_G3', 0.25), ('NOTE_A3', 0.25), ('NOTE_A3', 0.25), ('NOTE_E4', 0.25),
    ('NOTE_E5', 0.25), ('NOTE_D5', 0.25), ('NOTE_C5', 0.25), ('NOTE_B4', 0.25), ('NOTE_G4', 0.25), ('NOTE_A3', 0.25), ('NOTE_A3', 0.125),
    ('NOTE_A3', 0.125), ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_A3', 0.125), ('NOTE_G3', 0.125), ('NOTE_A3', 0.125),
    ('NOTE_G3', 0.125), ('NOTE_A3', 0.25), ('NOTE_F4', 0.125), ('NOTE_G4', 0.25), ('NOTE_G4', 0.25), ('NOTE_E4', 0.25), ('NOTE_D4', 0.25),
    ('NOTE_C4', 0.25), ('NOTE_E4', 0.5), ('NOTE_A3', 0.5), ('NOTE_C5', 0.125), ('NOTE_B4', 0.125), ('NOTE_G4', 0.125), ('NOTE_E4', 0.125),
    ('NOTE_E4', 0.125), ('NOTE_G4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_C5', 0.125), ('NOTE_B4', 0.125), ('NOTE_G4', 0.125),
    ('NOTE_E4', 0.125), ('NOTE_E4', 0.125), ('NOTE_G4', 0.125), ('NOTE_D4', 0.125), ('NOTE_E4', 0.125), ('NOTE_A4', 0.125), ('NOTE_G4', 0.125),
    ('NOTE_A4', 0.125), ('NOTE_B4', 0.125), ('NOTE_C5', 0.125), ('NOTE_D5', 0.125), ('NOTE_B4', 0.125), ('NOTE_C5', 0.125), ('NOTE_D5', 0.125),
    ('NOTE_B4', 0.125), ('NOTE_C5', 0.125), ('NOTE_G5', 0.125), ('NOTE_F5', 0.125), ('NOTE_E5', 0.125), ('NOTE_D5', 0.125), ('NOTE_C5', 0.125),
    ('NOTE_A5', 0.125), ('NOTE_G5', 0.125), ('NOTE_A5', 0.125), ('NOTE_B5', 0.125), ('NOTE_C6', 0.125), ('NOTE_B5', 0.125), ('NOTE_C6', 0.125),
    ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_G6', 0.125), ('NOTE_G6', 0.125), ('NOTE_E6', 0.125),
    ('NOTE_D6', 0.125), ('NOTE_C6', 0.125), ('NOTE_A5', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.125), ('NOTE_A5', 0.125), ('NOTE_D6', 0.125),
    ('NOTE_E6', 0.125), ('NOTE_A5', 0.125), ('NOTE_G6', 0.125), ('NOTE_A6', 0.125), ('NOTE_E6', 0.125), ('NOTE_G6', 0.125), ('NOTE_A6', 0.125),
    ('NOTE_A5', 0.125), ('NOTE_D6', 0.125), ('NOTE_E6', 0.25), ('NOTE_C5', 0.25), ('NOTE_B4', 0.25), ('NOTE_G4', 0.25), ('NOTE_A4', 0.25),
    ('NOTE_E4', 0.25), ('NOTE_G4', 0.25), ('NOTE_D4', 0.25), ('NOTE_E4', 0.25), ('NOTE_C4', 0.25), ('NOTE_D4', 0.25), ('NOTE_B3', 0.25),
    ('NOTE_C4', 0.25), ('NOTE_G3', 0.25), ('NOTE_B3', 0.25), ('NOTE_E3', 0.25), ('NOTE_G3', 0.25), ('NOTE_A3', 0.5), ('NOTE_E4', 0.5),
    ('NOTE_D4', 0.5), ('NOTE_E4', 0.5), ('NOTE_B3', 0.5), ('NOTE_A3', 0.5), ('NOTE_C4', 0.5), ('NOTE_D4', 0.5), ('NOTE_E4', 0.5),
    ('NOTE_G4', 0.5), ('NOTE_A4', 0.5)
]


# 歌曲速度：每拍持续时间（秒）
BEAT_DURATION = 0.5

# ----- 核心播放函数-----
def play_note(note, duration_beats):
    """播放单个音符,包含PWM频率设置与持续时间控制"""
    print(f"Playing note: {note}, for {duration_beats} beats")
    frequency = NOTES.get(note, 0)
    
    if frequency > 0:
        buzzer.freq(frequency)  # 直接调用PWM的freq方法
        buzzer.duty_u16(32768)  # 50%占空比（控制音量）
    
    utime.sleep(duration_beats * BEAT_DURATION)
    
    buzzer.duty_u16(0)  # 停止发声
    utime.sleep(0.05)  # 音符间隔 

# ----- 主循环-----
print("音乐播放器已启动...")

while True:
    print("\n--- Playing 'Twinkle Twinkle Little Star' ---")
    for note, beats in SONG:
        play_note(note, beats)
    
    print("--- Song Finished. Restarting in 2 seconds. ---")
    utime.sleep(2)   

